tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling1D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            prghPressure;
        p               uniform 100000;
        value           uniform 100000;
    }
    wall1
    {
        type            fixedFluxPressure;
    }
    wall2
    {
        type            fixedFluxPressure;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
